const postsData = [
    {
        title: "안녕하세요", 
        date: "2025년 6월 20일",
        publishDate: "2025-06-20T10:00:00",
        summary: "드디어 만들었어@",
        content: "<p> 꿈에 그리던 블로그를 개설했다. ㅋㅋㅋ 기분이 좋은 하루고 되었다. 이런 날들이 늘 계속 되면 좋겠다.</p>",
        isApp: false,
        appUrl: null
    },
    
    {
        title: "Day 1: 인터랙티브 운동 로거",
        date: "2025년 9월 14일", 
        publishDate: "2025-09-14T09:00:00", // 예약 발행 시간
        summary: "하루의 운동 계획을 실시간으로 기록하는 앱",
        content: "<p>하루의 운동 계획을 보고, 각 항목을 클릭하여 실시간으로 기록하는 앱입니다. 아래 버튼으로 실행할 수 있습니다.</p>",
        isApp: true,
        appUrl: "./001/"
    },
    {
        title: "노래 연습 앱 (Lyric Flow)",
        date: "2025년 9월 14일",
        publishDate: "2025-09-14T11:00:00",
        summary: "노래를 연습 할 수 있는 앱 입니다.",
        content: "<p>노래를 연습 할 수 있는 앱 입니다.</p><p>종종 노래를 연습하고 싶은데, 원곡을 들으면서 연습을 하면, 원곡처럼 부르게 되어서, 내 목소리에 맞지 않는 음정으로 노래를 부르게 되어서 연습이 안됩니다.</p><p>따라서 노래를 실행하지 않고도 노래 연습을 할 수 있는 앱을 만들었습니다.</p><p>앱 이름은 Lyric Flow! , 가사  흐름이라는 뜻을 갖습니다.</p>",
        isApp: true,
        appUrl: "./002/"
    },
    // {
    //     title: "미래에서 온 게시물 (예약 기능 테스트)",
    //     date: "2025년 9월 15일",
    //     // publishDate: "2025-09-15T12:00:00", // 이 게시물은 2025년 9월 15일 정오에 나타납니다.
    //     publishDate: "2025-09-14T22:49:53",
    //     summary: "이 게시물은 내일 나타납니다.",
    //     content: "<p>이 게시물은 예약 발행 기능 테스트를 위해 작성되었습니다. 지금 보인다면 정상적으로 기능이 구현된 것입니다.</p>",
    //     isApp: false,
    //     appUrl: null
    // },
];

